ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/TIMG4_2_1.0.xml
        <register id="TIMG4_2_GEN_EVENT1_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="Z" description="Zero event SET" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="L" description="Load event SET" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCD0" description="Capture or compare down event SET" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCD1" description="Capture or compare down event SET" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCU0" description="Capture or compare up event SET" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCU1" description="Capture or compare up event SET" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="TOV" description="Trigger Overflow event SET" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
        </register>
        <register id="TIMG4_2_GEN_EVENT1_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="Z" description="Zero event CLEAR" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="L" description="Load event CLEAR" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="CCD0" description="Capture or compare down event CLEAR" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="CCD1" description="Capture or compare down event CLEAR" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="CCU0" description="Capture or compare up event CLEAR" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="CCU1" description="Capture or compare up event CLEAR" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="TOV" description="Trigger Overflow event CLEAR" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
        </register>
        </group>
    <register id="TIMG4_2_EVT_MODE" width="32" offset="0x10E0" description="Event Mode">
        <bitfield id="EVT0_CFG" description="Event line mode select for event corresponding to CPU_INT" begin="1" end="0" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT1_CFG" description="Event line mode select for event corresponding to GEN_EVENT0" begin="3" end="2" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
        <bitfield id="EVT2_CFG" description="Event line mode select for event corresponding to GEN_EVENT1" begin="5" end="4" width="2" rwaccess="R">
            <bitenum id="DISABLE" value="0x0" description="The interrupt or event line is disabled."/>
            <bitenum id="SOFTWARE" value="0x1" description="The interrupt or event line is in software mode. Software must clear the RIS."/>
            <bitenum id="HARDWARE" value="0x2" description="The interrupt or event line is in hardware mode. The hardware (another module) clears automatically the associated RIS flag."/>
        </bitfield>
    </register>
